//შექმენით სია სადაც იქნება user-ების სახელი და გვარი და ახალ სიაში დაამატეთ ამ იუსერების  ინიციალები სახელის და გვარის პირველი ასოები, მაგალითად: გიორგი ბიბილაშვილი -> გ.ბ

let names = ['გიორგი თავაძე', 'გიორგი ხუციშვილი', 'ნიკა თავართქილაძე', 'ალექსანდრე ძუკაევი', 'მარიამ მჭედლიშვილი', 'გოგა ასათიანი', 'ნიკოლოზ აბულაძე', 'თორნიკე ხოზრევანიძე', 'ანა ფუთურიძე', 'გიორგი თაყაძე']

let initials = []

for (let name of names){
    initials.push(name[0] + '.' + name[name.indexOf(' ')+1] + '.')
}

console.log(initials)