# 6) შექმენით სია სადაც იქნება 20 განსხვავებული რიცხვი, შექმენით ორი ახალი სია ერთი ლუწებისთვის მეორე კენტებისთვის ორივე იქნება თავდაპირველად ცარიელი, 
# გაფილტრეთ სია რომელშიც არის 20 განსხვავებული რიცხვი ამ სიიდან ამოარჩიეთ ყველა ლუწი რიცხვი და დაამატეთ ლუწებისთვის განკუთვნილ სიაში ხოლო კენტები კენტებისთვის განკუთვნილ სიაში

num_list = [179, 196, 128, 98, 86, 70, 199, 43, 56, 66, 194, 48, 52, 119, 175, 20, 19, 61, 23, 21]

even = []
odd=[]

for num in num_list:
    if num %2 ==0:
        even.append(num)
    else:
        odd.append(num)

print("Even: ", even)
print("Odd: ", odd)