

#exercise n4

# Case-სენსიტიურობა გულისხმობს იმას, თუ როგორ აღიქვამს პროგრამირების ენა პატარა და დიდ ასოებს (uppercase, lowercase), 
# მაგალითად, Python არის Case-Sensitive, რაც იმას ნიშნავს, რომ ერთი და იგივე სიტყვები არ აღიქმება როგორც ერთი, თუ ერთი სიტყვა ან მასში ერთი ასოც კი დიდი ასოებითაა დაწერილი, ხოლო მეორე პატარებით.
# ცვლადი name, და ცვლადი "Name" ან "NAME" Python-ში ერთი არ არის. ზუსტად ესაა Case-Sensitivity


#snake case არის ერთ ცვლადში ორი ან მეტი სიტყვის დაწერის ერთ-ერთი ხერხი. snake case-ის მიხედვით, ცვლადში სიტყვებს შორის ქვედა-ტირე (underscore) უნდა დავწეროთ
#მაგალითად your_name (როგორც ამ ფაილში); shopping_cart; file_name etc.

